FilePond.registerPlugin(
  FilePondPluginImageExifOrientation,
  FilePondPluginImageCrop,
  FilePondPluginFileValidateType,
  FilePondPluginImagePreview
);

FilePond.create(document.querySelector('input[type="file"]'), {
  acceptedFileTypes: ["image/*"],
});

FilePond.setOptions({
  labelIdle: [
    '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M22.5 18.5h-2.25v.469c0 .187-.14.281-.281.281H2.53c-.187 0-.281-.094-.281-.281V7.53c0-.14.094-.281.281-.281H3V5h-.75A2.25 2.25 0 000 7.25v12a2.22 2.22 0 002.25 2.25h18a2.25 2.25 0 002.25-2.25v-.75zm1.969-15.75c.14 0 .281.14.281.281V14.47c0 .187-.14.281-.281.281H7.03c-.187 0-.281-.094-.281-.281V3.03c0-.14.094-.281.281-.281h17.44zM24.75.5h-18A2.25 2.25 0 004.5 2.75v12A2.22 2.22 0 006.75 17h18A2.25 2.25 0 0027 14.75v-12C27 1.531 25.969.5 24.75.5zM12.375 5.75A1.88 1.88 0 0010.5 3.875 1.85 1.85 0 008.625 5.75c0 1.078.797 1.875 1.875 1.875a1.851 1.851 0 001.875-1.875zM9 10.25v2.25h13.5V8.75l-3.375-3.328a.54.54 0 00-.797 0L13.5 10.25l-1.875-1.828a.54.54 0 00-.797 0L9 10.25z" fill="currentColor" fill-rule="nonzero"/></svg><span class="filepond--label-action">загрузить фото</span>',
  ],
  labelInvalidField: ["Поле содержит не верный формат файла"],
  labelFileWaitingForSize: ["В ожидании размера"],
  labelFileSizeNotAvailable: ["Не приемлимый размер"],
  labelFileCountSingular: ["файл в списке"],
  labelFileCountPlural: ["файлы в списке"],
  labelFileLoading: ["Загрузка"],
  labelFileAdded: ["Добавлен"], // assistive only
  labelFileLoadError: ["Ошибка в процессе загрузки"],
  labelFileRemoved: ["Удален"], // assistive only
  labelFileRemoveError: ["Ошибка в процессе удаления"],
  labelFileProcessing: ["Загрузка"],
  labelFileProcessingComplete: ["Загрузка завершена"],
  labelFileProcessingAborted: ["Загрузка отменена"],
  labelFileProcessingError: ["Ошибка в процессе загрузки"],
  labelFileProcessingRevertError: ["Ошибка в процессе возврата"],

  labelTapToCancel: ["Нажмите для отмены"],
  labelTapToRetry: ["Нажмите для повтора"],
  labelTapToUndo: ["Нажмите для возврата"],

  labelButtonRemoveItem: ["Удалить"],
  labelButtonAbortItemLoad: ["Отмена"],
  labelButtonRetryItemLoad: ["Повтор"],
  labelButtonAbortItemProcessing: ["Отмена"],
  labelButtonUndoItemProcessing: ["Вернуть"],
  labelButtonRetryItemProcessing: ["Повтор"],
  labelButtonProcessItem: ["Загрузка"],
  iconRemove: [
    '<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.7031 9L16.7656 3.98438C17.0469 3.70312 17.0469 3.1875 16.7656 2.90625L15.5938 1.73438C15.3125 1.45312 14.7969 1.45312 14.5156 1.73438L9.5 6.79688L4.4375 1.73438C4.15625 1.45312 3.64062 1.45312 3.35938 1.73438L2.1875 2.90625C1.90625 3.1875 1.90625 3.70312 2.1875 3.98438L7.25 9L2.1875 14.0625C1.90625 14.3438 1.90625 14.8594 2.1875 15.1406L3.35938 16.3125C3.64062 16.5938 4.15625 16.5938 4.4375 16.3125L9.5 11.25L14.5156 16.3125C14.7969 16.5938 15.3125 16.5938 15.5938 16.3125L16.7656 15.1406C17.0469 14.8594 17.0469 14.3438 16.7656 14.0625L11.7031 9Z" fill="white"/><path d="M11.7031 9L10.9993 8.28961L10.2856 8.9967L10.996 9.70711L11.7031 9ZM16.7656 3.98438L17.4694 4.69477L17.4727 4.69148L16.7656 3.98438ZM14.5156 1.73438L13.8085 1.02726L13.8052 1.03056L14.5156 1.73438ZM9.5 6.79688L8.79289 7.50398L9.5033 8.21439L10.2104 7.50069L9.5 6.79688ZM2.1875 3.98438L1.48039 4.69149L1.48369 4.69476L2.1875 3.98438ZM7.25 9L7.95711 9.70711L8.66751 8.9967L7.95381 8.28961L7.25 9ZM9.5 11.25L10.2104 10.5462L9.5033 9.83249L8.79289 10.5429L9.5 11.25ZM14.5156 16.3125L13.8052 17.0163L13.8085 17.0196L14.5156 16.3125ZM12.4069 9.71039L17.4694 4.69476L16.0618 3.27399L10.9993 8.28961L12.4069 9.71039ZM17.4727 4.69148C18.1445 4.01971 18.1445 2.87092 17.4727 2.19914L16.0585 3.61336C15.9833 3.53816 15.9766 3.46843 15.9766 3.44531C15.9766 3.42219 15.9833 3.35247 16.0585 3.27727L17.4727 4.69148ZM17.4727 2.19914L16.3009 1.02727L14.8866 2.44148L16.0585 3.61336L17.4727 2.19914ZM16.3009 1.02727C15.6291 0.355494 14.4803 0.355494 13.8085 1.02727L15.2227 2.44148C15.1475 2.51668 15.0778 2.52344 15.0547 2.52344C15.0316 2.52344 14.9618 2.51668 14.8866 2.44148L16.3009 1.02727ZM13.8052 1.03056L8.78961 6.09306L10.2104 7.50069L15.226 2.43819L13.8052 1.03056ZM10.2071 6.08977L5.14461 1.02727L3.73039 2.44148L8.79289 7.50398L10.2071 6.08977ZM5.14461 1.02727C4.47283 0.355494 3.32404 0.355494 2.65227 1.02727L4.06648 2.44148C3.99128 2.51668 3.92156 2.52344 3.89844 2.52344C3.87532 2.52344 3.80559 2.51668 3.73039 2.44148L5.14461 1.02727ZM2.65227 1.02727L1.48039 2.19914L2.89461 3.61336L4.06648 2.44148L2.65227 1.02727ZM1.48039 2.19914C0.808619 2.87092 0.808619 4.01971 1.48039 4.69148L2.89461 3.27727C2.96981 3.35247 2.97656 3.42219 2.97656 3.44531C2.97656 3.46843 2.96981 3.53816 2.89461 3.61336L1.48039 2.19914ZM1.48369 4.69476L6.54619 9.71039L7.95381 8.28961L2.89131 3.27399L1.48369 4.69476ZM6.54289 8.29289L1.48039 13.3554L2.89461 14.7696L7.95711 9.70711L6.54289 8.29289ZM1.48039 13.3554C0.808619 14.0272 0.808619 15.176 1.48039 15.8477L2.89461 14.4335C2.96981 14.5087 2.97656 14.5784 2.97656 14.6016C2.97656 14.6247 2.96981 14.6944 2.89461 14.7696L1.48039 13.3554ZM1.48039 15.8477L2.65227 17.0196L4.06648 15.6054L2.89461 14.4335L1.48039 15.8477ZM2.65227 17.0196C3.32404 17.6914 4.47283 17.6914 5.14461 17.0196L3.73039 15.6054C3.80559 15.5302 3.87532 15.5234 3.89844 15.5234C3.92156 15.5234 3.99128 15.5302 4.06648 15.6054L2.65227 17.0196ZM5.14461 17.0196L10.2071 11.9571L8.79289 10.5429L3.73039 15.6054L5.14461 17.0196ZM8.78961 11.9538L13.8052 17.0163L15.226 15.6087L10.2104 10.5462L8.78961 11.9538ZM13.8085 17.0196C14.4803 17.6914 15.6291 17.6914 16.3009 17.0196L14.8866 15.6054C14.9618 15.5302 15.0316 15.5234 15.0547 15.5234C15.0778 15.5234 15.1475 15.5302 15.2227 15.6054L13.8085 17.0196ZM16.3009 17.0196L17.4727 15.8477L16.0585 14.4335L14.8866 15.6054L16.3009 17.0196ZM17.4727 15.8477C18.1445 15.176 18.1445 14.0272 17.4727 13.3554L16.0585 14.7696C15.9833 14.6944 15.9766 14.6247 15.9766 14.6016C15.9766 14.5784 15.9833 14.5087 16.0585 14.4335L17.4727 15.8477ZM17.4727 13.3554L12.4102 8.29289L10.996 9.70711L16.0585 14.7696L17.4727 13.3554Z" fill="black"/></svg>',
  ],
  iconProcess: [
    '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M14 10.414v3.585a1 1 0 0 1-2 0v-3.585l-1.293 1.293a1 1 0 0 1-1.414-1.415l3-3a1 1 0 0 1 1.414 0l3 3a1 1 0 0 1-1.414 1.415L14 10.414zM9 18a1 1 0 0 1 0-2h8a1 1 0 0 1 0 2H9z" fill="currentColor" fill-rule="evenodd"/></svg>',
  ],
  iconRetry: [
    '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M10.81 9.185l-.038.02A4.997 4.997 0 0 0 8 13.683a5 5 0 0 0 5 5 5 5 0 0 0 5-5 1 1 0 0 1 2 0A7 7 0 1 1 9.722 7.496l-.842-.21a.999.999 0 1 1 .484-1.94l3.23.806c.535.133.86.675.73 1.21l-.804 3.233a.997.997 0 0 1-1.21.73.997.997 0 0 1-.73-1.21l.23-.928v-.002z" fill="currentColor" fill-rule="nonzero"/></svg>',
  ],
  iconUndo: [
    '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M9.185 10.81l.02-.038A4.997 4.997 0 0 1 13.683 8a5 5 0 0 1 5 5 5 5 0 0 1-5 5 1 1 0 0 0 0 2A7 7 0 1 0 7.496 9.722l-.21-.842a.999.999 0 1 0-1.94.484l.806 3.23c.133.535.675.86 1.21.73l3.233-.803a.997.997 0 0 0 .73-1.21.997.997 0 0 0-1.21-.73l-.928.23-.002-.001z" fill="currentColor" fill-rule="nonzero"/></svg>',
  ],
  iconDone: [
    '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M18.293 9.293a1 1 0 0 1 1.414 1.414l-7.002 7a1 1 0 0 1-1.414 0l-3.998-4a1 1 0 1 1 1.414-1.414L12 15.586l6.294-6.293z" fill="currentColor" fill-rule="nonzero"/></svg>',
  ],
  styleButtonRemoveItemPosition: "center",
  maxFiles: 10,
  allowPaste: false,
  dropOnElement: false,
  dropOnPage: true,
});

if (document.defaultView.screen.width > 1440) {
  FilePond.setOptions({
    imagePreviewHeight: 100,
    imageCropAspectRatio: "1:1",
  });
}

const pond = document.querySelector(".filepond--root");
const pondCountChilds = document.querySelector(".filepond--list");
const dropLabel = document.querySelector(".filepond--drop-label");
const listScroller = document.querySelector(".filepond--list-scroller");

pond.addEventListener("FilePond:addfile", async () => {
  FilePond.setOptions({
    labelIdle: [
      '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M22.5 18.5h-2.25v.469c0 .187-.14.281-.281.281H2.53c-.187 0-.281-.094-.281-.281V7.53c0-.14.094-.281.281-.281H3V5h-.75A2.25 2.25 0 000 7.25v12a2.22 2.22 0 002.25 2.25h18a2.25 2.25 0 002.25-2.25v-.75zm1.969-15.75c.14 0 .281.14.281.281V14.47c0 .187-.14.281-.281.281H7.03c-.187 0-.281-.094-.281-.281V3.03c0-.14.094-.281.281-.281h17.44zM24.75.5h-18A2.25 2.25 0 004.5 2.75v12A2.22 2.22 0 006.75 17h18A2.25 2.25 0 0027 14.75v-12C27 1.531 25.969.5 24.75.5zM12.375 5.75A1.88 1.88 0 0010.5 3.875 1.85 1.85 0 008.625 5.75c0 1.078.797 1.875 1.875 1.875a1.851 1.851 0 001.875-1.875zM9 10.25v2.25h13.5V8.75l-3.375-3.328a.54.54 0 00-.797 0L13.5 10.25l-1.875-1.828a.54.54 0 00-.797 0L9 10.25z" fill="currentColor" fill-rule="nonzero"/></svg><span class="filepond--label-action">загрузить еще фото</span>',
    ],
  });

  if (document.defaultView.screen.width > 1440) {
    dropLabel.style.transform = "translate3d(0px,100px,0px";
    setTimeout(() => {
      listScroller.style.transform = "translate3d(0px,-20px,0px";
    }, 1200);
  }
});

pond.addEventListener("FilePond:removefile", async () => {
  if (
    pondCountChilds.childElementCount == 1 &&
    document.defaultView.screen.width > 1440
  ) {
    dropLabel.style.transform = "translate3d(0px,0px,0px";
  }
  setTimeout(() => {
    if (pondCountChilds.childElementCount == 0) {
      FilePond.setOptions({
        labelIdle: [
          '<svg width="26" height="26" viewBox="0 0 26 26" xmlns="http://www.w3.org/2000/svg"><path d="M22.5 18.5h-2.25v.469c0 .187-.14.281-.281.281H2.53c-.187 0-.281-.094-.281-.281V7.53c0-.14.094-.281.281-.281H3V5h-.75A2.25 2.25 0 000 7.25v12a2.22 2.22 0 002.25 2.25h18a2.25 2.25 0 002.25-2.25v-.75zm1.969-15.75c.14 0 .281.14.281.281V14.47c0 .187-.14.281-.281.281H7.03c-.187 0-.281-.094-.281-.281V3.03c0-.14.094-.281.281-.281h17.44zM24.75.5h-18A2.25 2.25 0 004.5 2.75v12A2.22 2.22 0 006.75 17h18A2.25 2.25 0 0027 14.75v-12C27 1.531 25.969.5 24.75.5zM12.375 5.75A1.88 1.88 0 0010.5 3.875 1.85 1.85 0 008.625 5.75c0 1.078.797 1.875 1.875 1.875a1.851 1.851 0 001.875-1.875zM9 10.25v2.25h13.5V8.75l-3.375-3.328a.54.54 0 00-.797 0L13.5 10.25l-1.875-1.828a.54.54 0 00-.797 0L9 10.25z" fill="currentColor" fill-rule="nonzero"/></svg><span class="filepond--label-action">загрузить фото</span>',
        ],
      });
    }
  }, 700);
});
